//=========================================================================================
//
//[blowngage.h]
//Author:日野澤匠泉
//
//=========================================================================================
#ifndef _BLOWNGAGE_H_			//このマクロ定義がされなかったら
#define _BLOWNGAGE_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"

//*****************************************************************************************
//前方宣言
//*****************************************************************************************
class CObject2D;

//*****************************************************************************************
//オブジェクトクラス
//*****************************************************************************************
class CBlowngage
{
public:
	CBlowngage();
	~CBlowngage();

	static HRESULT Load(void);
	static void Unload(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CBlowngage* Create(void);
	void SetScore(D3DXVECTOR3 pos, int nCnt, int aTexU);
	void AddScore(int nCnt, int aTexU);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
	CObject2D* m_pObject2D;
};

#endif

