//=========================================================================================
//
//ぶっ飛び[blown.h]
//Author:日野澤匠泉
//
//=========================================================================================
#ifndef _BLOWN_H_	//この定義がされていなかったら
#define _BLOWN_H_	//二重インクルード防止のマクロ定義をする

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include"main.h"

//*****************************************************************************************
//前方宣言
//*****************************************************************************************
class CBlowngage;

//*****************************************************************************************
//マクロ定義
//*****************************************************************************************
#define NUM_PLACE3		(3)		//スコアの桁数

//*****************************************************************************************
//クラス定義
//*****************************************************************************************
class CBlown
{
public:
	CBlown();
	~CBlown();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CBlown* Create(void);

	void Set(void);
	void Add(int nValue);
	void Sub(int nValue);
	int Get(void);
	void SetPosition(D3DXVECTOR3 pos);

	int GetBlown(void);
	void SetBlown(int nBlown);

private:
	int m_nBlown;						//スコア
	int m_nValue;						//スコアの総数
	int m_nCtr;							//カウンター
	D3DXVECTOR3 m_pos;					//位置情報
	CBlowngage* m_apNumber[NUM_PLACE3];	//数字情報
	int m_Dist;
};

#endif

