//=========================================================================================
//
// エフェクト処理 [effect.cpp]
//	Author:日野澤匠泉
//
//=========================================================================================

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "effect.h"
#include "manager.h"
#include "renderer.h"
#include "objectbillboard.h"

//*****************************************************************************************
//マクロ定義
//*****************************************************************************************
#define MAX_EFFECT		(1028)		//エフェクトの最大数
#define SIZE			(5.0f)		//エフェクトのサイズ
#define GRAVITY			(2.0f)		//重力
#define LIFE			(50)		//エフェクトの寿命

//*****************************************************************************************
//静的メンバ変数初期化
//*****************************************************************************************
LPDIRECT3DTEXTURE9 CEffect::m_pTexture = nullptr;

//=========================================================================================
//コンストラクタ
//=========================================================================================
CEffect::CEffect()
{
	m_nLife = 0;
}

//=========================================================================================
//デストラクタ
//=========================================================================================
CEffect::~CEffect()
{

}

//=========================================================================================
//エフェクトのテクスチャ読み込み
//=========================================================================================
HRESULT CEffect::Load(void)
{
	//オブジェクト取得
	CRenderer* pRenderer = CManager::GetManager()->GetRenderer();

	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\effect000.jpg",
		&m_pTexture);

	return S_OK;
}

//=========================================================================================
//エフェクトのテクスチャ破棄
//=========================================================================================
void CEffect::Unload(void)
{
	//テクスチャの破棄
	if (m_pTexture != nullptr)
	{
		m_pTexture->Release();
		m_pTexture = nullptr;
	}
}

//=========================================================================================
//エフェクトの初期化処理
//=========================================================================================
HRESULT CEffect::Init(void)
{
	//種類の設定
	SetType(TYPE_EFFECT);

	//ビルボードの初期化
	CObjectBillboard::Init();

	m_nLife = LIFE;

	return S_OK;
}

//=========================================================================================
//エフェクトの終了処理
//=========================================================================================
void CEffect::Uninit(void)
{
	//ビルボードの終了処理
	CObjectBillboard::Uninit();
}

//=========================================================================================
//エフェクトの更新処理
//=========================================================================================
void CEffect::Update(void)
{
	//カラーの取得
	D3DXCOLOR col = GetCol();
	col = D3DXCOLOR(1.0f,0.0f,0.0f,1.0f);

	//移動量の取得
	D3DXVECTOR3 move = GetMove();
	move.y -= GRAVITY;

	//位置情報取得
	D3DXVECTOR3 pos = GetPosition();

	if (pos.y <= -200.0f)
	{//床よりしただった時

		move.y += 5.0f;
	}

	//移動量加算
	pos += move;

	//ライフの減少
	m_nLife--;

	if (m_nLife <= 0)
	{
		Uninit();
		return;
	}

	//設定処理
	SetCol(col);
	SetMove(move);
	SetPos(pos);
	SetSize(SIZE,SIZE);
}

//=========================================================================================
//エフェクトの描画処理
//=========================================================================================
void CEffect::Draw(void)
{
	//オブジェクト取得
	CRenderer* pRenderer = CManager::GetManager()->GetRenderer();

	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	//aブレンディングを加算合成に設定
	pDevice->SetRenderState(D3DRS_BLENDOP, D3DBLENDOP_ADD);
	pDevice->SetRenderState(D3DRS_SRCBLEND, D3DBLEND_SRCALPHA);
	pDevice->SetRenderState(D3DRS_DESTBLEND, D3DBLEND_ONE);

	CObjectBillboard::Draw();

	//aブレンディングを元に戻す
	pDevice->SetRenderState(D3DRS_BLENDOP, D3DBLENDOP_ADD);
	pDevice->SetRenderState(D3DRS_SRCBLEND, D3DBLEND_SRCALPHA);
	pDevice->SetRenderState(D3DRS_DESTBLEND, D3DBLEND_INVSRCALPHA);
}

//=========================================================================================
//エフェクトの生成処理
//=========================================================================================
CEffect* CEffect::Create(void)
{
	//ポインタの変数を宣言
	CEffect* pEffect;

	//オブジェクト3Dの生成
	pEffect = new CEffect;

	if (pEffect != NULL)
	{//使用されているとき

		//初期化処理
		pEffect->Init();

		//テクスチャ
		pEffect->BindTexture(m_pTexture);
	}

	//オブジェクト情報を返す
	return pEffect;
}

