//=========================================================================================
//
//[game.cpp]
//Author:日野澤匠泉
//
//=========================================================================================

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "number.h"
#include "score.h"
#include "light.h"
#include "camera.h"
#include "playerx.h"
#include "time.h"
#include "game.h"
#include "input.h"
#include "string.h"
#include "sound.h"
#include "manager.h"
#include "building.h"
#include "boss.h"
#include "bullet3D.h"
#include "explosion3D.h"
#include "spawner.h"
#include "skybox.h"
#include <stdio.h>

//*****************************************************************************************
//静的メンバ変数
//*****************************************************************************************
CPlayerX *CGame::m_pPlayerX = nullptr;
CBoss* CGame::m_pBoss = nullptr;
CScore *CGame::m_pScore = nullptr;
CCamera *CGame::m_pCamera = nullptr;
CLight *CGame::m_pLight = nullptr;
CObjectX *CGame::m_pObjectX = nullptr;
CBuilding *CGame::m_apBuilding[NUM_BUILD] = {};
CSpawner* CGame::m_pSpawner = nullptr;
CSkybox* CGame::m_pSkybox = nullptr;

//=========================================================================================
//ゲームのコンストラクタ
//=========================================================================================
CGame::CGame()
{
	m_nCtr = 0;
}

//=========================================================================================
//ゲームのデストラクタ	
//=========================================================================================
CGame::~CGame()
{

}

//=========================================================================================
//ゲームの初期化処理	
//=========================================================================================
HRESULT CGame::Init(void)
{
	//サウンド情報取得
	CSound *pSound = CManager::GetManager()->GetSound();

	//********************************************************
	//カメラの生成
	//********************************************************
	if (m_pCamera == nullptr)
	{//使用されていないとき

		//生成
		m_pCamera = new CCamera;
	}
	if (m_pCamera != nullptr)
	{//使用されているとき

		//カメラの初期化処理
		m_pCamera->Init();
	}

	//********************************************************
	//ライトの生成
	//********************************************************
	if (m_pLight == nullptr)
	{//使用されていないとき

		//生成
		m_pLight = new CLight;
	}

	if (m_pLight != nullptr)
	{//使用されているとき

		//ライトの初期化処理
		m_pLight->Init();
	}

	//********************************************************
	//テクスチャ読み込み
	//********************************************************
	CNumber::Load();
	CBullet3D::Load();
	CExplosion3D::Load();

	//********************************************************
	//プレイヤー
	//********************************************************
	if (m_pPlayerX == nullptr)
	{//使用されていないとき

		//プレイヤー作成
		m_pPlayerX = CPlayerX::Create();
	}

	//********************************************************
	//スポナー
	//********************************************************
	if (m_pSpawner == nullptr)
	{//使用されていないとき

		//プレイヤー作成
		m_pSpawner = CSpawner::Create();
	}

	//********************************************************
	//スカイボックス
	//********************************************************
	if (m_pSkybox == nullptr)
	{//使用されていないとき

		//プレイヤー作成
		m_pSkybox = CSkybox::Create();

		m_pSkybox->SetPosition(D3DXVECTOR3(0.0f,-320.0f,0.0f));
	}

	//********************************************************
	//ボス
	//********************************************************
	if (m_pBoss == nullptr)
	{//使用されていないとき

		//ボス生成
		m_pBoss = CBoss::Create();
	}

	//********************************************************
	//建物 配置
	//********************************************************
	struct SBuildingInfo
	{
		CBuilding::TYPE mType;
		float mX;
		float mY;
		float mZ;
	};

	SBuildingInfo buildingInfo[] =
	{
		// チュートリアル 
		{ CBuilding::TYPE_START, 0.0f,-200.0f,0.0f },
	};

	for (int nCnt = 0; nCnt < NUM_BUILD; nCnt++)
	{
		if (m_apBuilding[nCnt] == NULL)
		{//使用されていないとき

			//プレイヤー作成
			m_apBuilding[nCnt] = CBuilding::Create();
			m_apBuilding[nCnt]->SetType(buildingInfo[nCnt].mType);
			m_apBuilding[nCnt]->SetPosition(D3DXVECTOR3(buildingInfo[nCnt].mX, buildingInfo[nCnt].mY, buildingInfo[nCnt].mZ));
		}
	}

	//********************************************************
	//スコア
	//********************************************************
	if (m_pScore == nullptr)
	{//使用されていないとき

		//スコアオブジェクトの情報を取得
		m_pScore = CScore::Create();

		//オブジェクト設定
		m_pScore->SetScore();
	}

	//********************************************************
	//サウンド
	//********************************************************
	pSound->PlaySound(CSound::SOUND_LABEL_BGM_GAME);

	return S_OK;
}

//=============================================================================
//ゲームの終了処理
//=============================================================================
void CGame::Uninit(void)
{
	//オブジェクトの破棄
	CObject::ReleaseAll();

	//********************************************************
	//スコア
	//********************************************************
	if (m_pScore != nullptr)
	{//使用されていたら

		//スコアの終了処理
		m_pScore->Uninit();

		//破棄
		delete m_pScore;

		//初期化
		m_pScore = nullptr;
	}

	//********************************************************
	//ライト
	//********************************************************
	if (m_pLight != nullptr)
	{
		//終了処理
		m_pLight->Uninit();

		//破棄
		delete m_pLight;

		//初期化
		m_pLight = nullptr;
	}

	//********************************************************
	//カメラ
	//********************************************************	
	if (m_pCamera != nullptr)
	{
		//終了処理
		m_pCamera->Uninit();

		//破棄
		delete m_pCamera;

		//初期化
		m_pCamera = nullptr;
	}

	//********************************************************
	//プレイヤー
	//********************************************************
	if (m_pPlayerX != nullptr)
	{//使用されているとき

		//初期化
		m_pPlayerX = nullptr;
	}

	//********************************************************
	//スポナー
	//********************************************************
	if (m_pSpawner != nullptr)
	{//使用されているとき

		//初期化
		m_pSpawner = nullptr;
	}

	//********************************************************
	//スカイボックス
	//********************************************************
	if (m_pSkybox == nullptr)
	{//使用されていないとき

		//プレイヤー作成
		m_pSkybox = nullptr;
	}

	//********************************************************
	//ボス
	//********************************************************
	if (m_pBoss != nullptr)
	{//使用されているとき

		//初期化
		m_pBoss = nullptr;
	}

	//********************************************************
	//建物
	//********************************************************
	for (int nCnt = 0; nCnt < NUM_BUILD; nCnt++)
	{
		if (m_apBuilding != nullptr)
		{//使用されているとき

			//初期化
			m_apBuilding[nCnt] = nullptr;
		}
	}

	//各種テクスチャ破棄
	CNumber::Unload();
	CBullet3D::Unload();
	CExplosion3D::Unload();
}

//=============================================================================
//ゲームの更新処理
//=============================================================================
void CGame::Update(void)
{
	//********************************************************
	//スコア
	//********************************************************
	if (m_pScore != nullptr)
	{//使用されていたら

		//更新処理
		m_pScore->Update();

		//スコアの更新
		m_pScore->AddScore(1);
	}

	//********************************************************
	//カメラ
	//********************************************************
	if (m_pCamera != nullptr)
	{//使用されていたら

		//更新処理
		m_pCamera->Update();
	}

	//プレイヤーの位置情報取得
	D3DXVECTOR3 pos = m_pPlayerX->GetPosition();
	
	if (pos.y <= -700.0f)
	{// プレイヤーが落ちた場合

		//サウンド情報取得
		CSound *pSound = CManager::GetManager()->GetSound();

		if (m_pScore != nullptr)
		{//使用されていたら

			//スコアの保存
			m_pScore->SaveScore();
		}

		//画面遷移
		CManager::GetManager()->SetMode(CScene::MODE_RANKING);

		//サウンドの再生
		pSound->PlaySound(CSound::SOUND_LABEL_SE_TRANSITION);
	}
}

//=============================================================================
//ゲームの描画処理
//=============================================================================
void CGame::Draw(void)
{
	//カメラ情報取得
	CCamera *pCamera = CGame::GetCamera();

	//カメラの描画
	pCamera->SetCamera();
}

//=========================================================================================
//ゲームの生成処理
//=========================================================================================
CGame *CGame::Create(void)
{
	//ポインタの変数を宣言
	CGame *pGame;

	//生成
	pGame = new CGame;

	if (pGame != nullptr)
	{//使用されているとき

		//初期化処理
		pGame->Init();
	}

	//オブジェクト情報を返す
	return pGame;
}

//=========================================================================================
//プレイヤー情報取得
//=========================================================================================
CPlayerX *CGame::GetPlayer(void)
{
	return m_pPlayerX;
}

//=========================================================================================
//ボス情報取得
//=========================================================================================
CBoss* CGame::GetBoss(void)
{
	return m_pBoss;
}

//=========================================================================================
//スコア情報取得
//=========================================================================================
CScore *CGame::GetScore(void)
{
	return m_pScore;
}

//=========================================================================================
//カメラの情報取得
//=========================================================================================
CCamera *CGame::GetCamera(void)
{
	return m_pCamera;
}

//=========================================================================================
//ライトの情報取得
//=========================================================================================
CLight *CGame::GetLight(void)
{
	return m_pLight;
}

//=========================================================================================
//ライトの情報取得
//=========================================================================================
CObjectX *CGame::GetObjectX(void)
{
	return m_pObjectX;
}

//=========================================================================================
//建物の情報取得
//=========================================================================================
CBuilding *CGame::GetBuilding(int nIdx)
{
	return m_apBuilding[nIdx];
}

//=========================================================================================
//スポナーの情報取得
//=========================================================================================
CSpawner* CGame::GetSpawner(void)
{
	return m_pSpawner;
}

//=========================================================================================
//スカイボックスの情報取得
//=========================================================================================
CSkybox* CGame::GetSkybox(void)
{
	return m_pSkybox;
}


