//=========================================================================================
//
//　ヒットポイント[hitpoint.h]
//　Author:日野澤匠泉
//
//=========================================================================================
#ifndef _HITPOINT_H_			//このマクロ定義がされなかったら
#define _HITPOINT_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"
#include "object2D.h"

//*****************************************************************************************
//ヒットポイントクラス
//*****************************************************************************************
class CHitpoint : public CObject2D
{
public:
	CHitpoint();
	~CHitpoint();

	static HRESULT Load(void);
	static void Unload(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CHitpoint* Create(void);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
};

#endif

