//=========================================================================================
//
// hp[hp.h]
// Author:日野澤匠泉
//
//=========================================================================================
#ifndef _HP_H_			//このマクロ定義がされなかったら
#define _HP_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"
#include "object2D.h"

//*****************************************************************************************
//スポナークラス
//*****************************************************************************************
class CHp : public CObject2D
{
public:
	CHp();
	~CHp();

	static HRESULT Load(void);
	static void Unload(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CHp* Create(void);
	void SetHp(D3DXVECTOR3 pos);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
	CObject2D* m_pObject2D;
};

#endif


