//=========================================================================================
//
//　体力バー背景[hpbg.h]
//　Author:日野澤匠泉
//
//=========================================================================================
#ifndef _HPBG_H_			//このマクロ定義がされなかったら
#define _HPBG_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"
#include "object2D.h"

//*****************************************************************************************
//ヒットポイントクラス
//*****************************************************************************************
class CHpbg : public CObject2D
{
public:
	CHpbg();
	~CHpbg();

	static HRESULT Load(void);
	static void Unload(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CHpbg* Create(void);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
};

#endif

