//=========================================================================================
//
//パーティクル処理
//Author:日野澤匠泉	[particle.h]
//
//=========================================================================================
#ifndef _PARTICLE_H_
#define _PARTICLE_H_

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"
#include "object.h"

//*****************************************************************************************
//前方宣言
//*****************************************************************************************
class CObjectBillboard;

//=========================================================================================
//パーティクルクラス
//=========================================================================================
class CParticle : public CObject
{
public:
	CParticle();
	~CParticle();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Set(D3DXVECTOR3 pos, D3DXVECTOR3 rot, float fHeight, float fWidth) override {}

	static CParticle* Create(D3DXVECTOR3 pos, int nType);

private:
	int m_nLife;
	D3DXVECTOR3 m_pos;
	int m_nType;
};

#endif
