//=========================================================================================
//
//　％[percent.h]
//　Author:日野澤匠泉
//
//=========================================================================================
#ifndef _PERCENT_H_			//このマクロ定義がされなかったら
#define _PERCENT_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"
#include "object2D.h"

//*****************************************************************************************
//ヒットポイントクラス
//*****************************************************************************************
class CPercent : public CObject2D
{
public:
	CPercent();
	~CPercent();

	static HRESULT Load(void);
	static void Unload(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CPercent* Create(void);

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
};

#endif

