//=========================================================================================
//
// スポナー
// Author:日野澤匠泉	[spawner.cpp]
//
//=========================================================================================
#include "main.h"
#include "spawner.h"
#include "manager.h"
#include "renderer.h"
#include "debugproc.h"
#include "objectX.h"
#include "playerx.h"
#include "score.h"
#include "time.h"
#include "game.h"
#include "enemyX.h"

//*****************************************************************************************
//静的メンバ変数
//*****************************************************************************************
CEnemyX* CSpawner::m_pEnemy = nullptr;

//=========================================================================================
//マクロ定義
//=========================================================================================
#define ENEMYMOVE	(2.0f)		//移動量

//*****************************************************************************************
//静的メンバ変数
//*****************************************************************************************
int CSpawner::m_Count = 0;

//=========================================================================================
//スポナーのコンストラクタ	
//=========================================================================================
CSpawner::CSpawner()
{

}

//=========================================================================================
//スポナーのデストラクタ
//=========================================================================================
CSpawner::~CSpawner()
{

}

//=========================================================================================
//スポナーの初期化処理
//=========================================================================================
HRESULT CSpawner::Init(void)
{
	//オブジェクトの初期化処理
	CObjectX::Init("data\\MODEL\\spawner_00.x");

	//種類の設定
	SetType(TYPE_SPAWNER);

	//位置更新
	SetPosition(D3DXVECTOR3(0.0f, 40.0f, -200.0f));

	//********************************************************
	//エネミー
	//********************************************************
	if (m_pEnemy == nullptr)
	{//使用されていないとき

		//プレイヤー作成
		m_pEnemy = CEnemyX::Create();
	}

	return S_OK;
}

//=========================================================================================
//スポナーの終了処理
//=========================================================================================
void CSpawner::Uninit(void)
{
	//オブジェクトの終了処理
	CObjectX::Uninit();

	//********************************************************
	//エネミー
	//********************************************************
	if (m_pEnemy != nullptr)
	{//使用されているとき

		//初期化
		m_pEnemy = nullptr;
	}
}

//=========================================================================================
//スポナーの更新処理
//=========================================================================================
void CSpawner::Update(void)
{
	//デバッグ情報取得
	CDebugProc* pDebug = CManager::GetManager()->GetDebugProc();

	//位置情報取得処理
	D3DXVECTOR3 pos = CObjectX::GetPosition();

	//変数宣言
	D3DXVECTOR3 Dest;
	float fRotMove, fRotDest, fRotDiff;

	//エネミー位置取得
	D3DXVECTOR3 EnemyPos = CObjectX::GetPosition();
	EnemyPos.y = 40.0f;

	//エネミー角度取得
	D3DXVECTOR3 EnemyRot = CObjectX::GetRot();

	//エネミー移動量取得
	D3DXVECTOR3 EnemyMove = CObjectX::GetMove();

	//プレイヤー情報取得
	CPlayerX* pPlayer = CGame::GetPlayer();
	D3DXVECTOR3 PlayerPos = pPlayer->GetPosition();

	Dest = PlayerPos - EnemyPos;			//目標の向き
	fRotMove = EnemyRot.y;					//現在の移動方向(角度)
	fRotDest = atan2f(Dest.x, Dest.z);		//目標の移動方向(角度)
	fRotDiff = fRotDest - fRotMove;			//目標の移動方向までの差分

	//移動方向の補正
	if (fRotDiff > D3DX_PI || fRotDiff < -D3DX_PI)
	{
		if (fRotDiff > D3DX_PI)
		{
			fRotDiff += -D3DX_PI * 2;
		}
		else if (fRotDiff < -D3DX_PI)
		{
			fRotDiff += D3DX_PI * 2;
		}
	}

	//移動方向(角度)の補正
	EnemyRot.y += fRotDiff * 0.05f;

	//移動方向の補正
	if (EnemyRot.y > D3DX_PI || EnemyRot.y < -D3DX_PI)
	{
		if (EnemyRot.y > D3DX_PI)
		{
			EnemyRot.y += -D3DX_PI * 2;
		}
		else if (EnemyRot.y < -D3DX_PI)
		{
			EnemyRot.y += D3DX_PI * 2;
		}
	}

	//移動量補正
	EnemyMove.x = sinf(EnemyRot.y) * ENEMYMOVE;
	EnemyMove.z = cosf(EnemyRot.y) * ENEMYMOVE;

	//移動量加算
	EnemyPos += EnemyMove;

	//位置更新
	SetPosition(EnemyPos);

	//向き更新
	SetRot(EnemyRot);

	//デバッグ表示
	pDebug->Print("[エネミー] ( X:%f Y:%f Z:%f )\n\n", pos.x, pos.y, pos.z);
}

//=========================================================================================
//スポナーの描画処理
//=========================================================================================
void CSpawner::Draw(void)
{
	//オブジェクトの描画処理
	CObjectX::Draw();
}

//=========================================================================================
//スポナーの生成処理
//=========================================================================================
CSpawner* CSpawner::Create(void)
{
	//ポインタの変数を宣言
	CSpawner* pSpawner;

	//オブジェクト3Dの生成
	pSpawner = new CSpawner;

	if (pSpawner != nullptr)
	{//使用されているとき

		//初期化処理
		pSpawner->Init();
	}

	//オブジェクト情報を返す
	return pSpawner;
}

//=========================================================================================
//スポナーのヒット処理
//=========================================================================================
void CSpawner::Hit(void)
{
	//スコアの情報取得
	CScore* pScore = CGame::GetScore();

	//スコアの加算
	pScore->AddScore(100);

	//終了処理
	CSpawner::Uninit();
}

//=========================================================================================
//スポナーのキル数
//=========================================================================================
int CSpawner::GetKillCount(void)
{
	return m_Count;
}

//=========================================================================================
//スポナーのキル数
//=========================================================================================
void CSpawner::SetKillCount(int nNum)
{
	m_Count = nNum;
}