//=========================================================================================
//
// スポナー [spawner.h]
// Author:日野澤匠泉
//
//=========================================================================================
#ifndef _SPAWNER_H_			//このマクロ定義がされなかったら
#define _SPAWNER_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"
#include "objectX.h"

//*****************************************************************************************
//前方宣言
//*****************************************************************************************
class CEnemyX;

//*****************************************************************************************
//スポナークラス
//*****************************************************************************************
class CSpawner : public CObjectX
{
public:
	CSpawner();
	~CSpawner();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Hit(void);
	static int GetKillCount(void);
	static void SetKillCount(int nNum);
	static CSpawner* Create(void);
	static CEnemyX* GetEnemy(void);

private:
	static int m_Count;
	static CEnemyX* m_pEnemy;
};

#endif


