//=========================================================================================
//
// [titlelogo.cpp]
// Author:日野澤匠泉
//
//=========================================================================================

//*****************************************************************************************
// インクルード
//*****************************************************************************************
#include "titlelogo.h"
#include "renderer.h"
#include "manager.h"
#include "object2D.h"
#include "input.h"
#include "sound.h"
#include "object.h"

//*****************************************************************************************
// 静的メンバ変数初期化
//*****************************************************************************************
LPDIRECT3DTEXTURE9 CTitlelogo::m_pTexture = nullptr;

//=========================================================================================
// タイトルロゴのコンストラクタ
//=========================================================================================
CTitlelogo::CTitlelogo()
{
	m_pTitlelogo = nullptr;
}

//=========================================================================================
// タイトルロゴのデストラクタ
//=========================================================================================
CTitlelogo::~CTitlelogo()
{

}

//=========================================================================================
// タイトルロゴのテクスチャ読み込み
//=========================================================================================
HRESULT CTitlelogo::Load(void)
{
	//オブジェクト取得
	CRenderer* pRenderer = CManager::GetManager()->GetRenderer();

	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data\\TEXTURE\\ColorconeSurvivors2_logo.png",
		&m_pTexture);

	return S_OK;
}

//=========================================================================================
// タイトルロゴのテクスチャ破棄
//=========================================================================================
void CTitlelogo::Unload(void)
{
	//テクスチャの破棄
	if (m_pTexture != nullptr)
	{
		m_pTexture->Release();
		m_pTexture = nullptr;
	}
}

//=========================================================================================
// タイトルロゴの初期化処理
//=========================================================================================
HRESULT CTitlelogo::Init(void)
{
	//種類の設定
	SetType(TYPE_TITLELOGO);

	if (m_pTitlelogo == nullptr)
	{//使用されていないとき

		//生成
		m_pTitlelogo = new CObject2D;
	}

	if (m_pTitlelogo != nullptr)
	{//使用されているとき

		//初期化処理
		m_pTitlelogo->Init();

		//テクスチャの割り当て
		m_pTitlelogo->BindTexture(m_pTexture);
	}

	//画像設定
	m_pTitlelogo->Set(D3DXVECTOR3(SCREEN_WIDTH / 2, 200.0f, 0.0f),
		D3DXVECTOR3(0.0f, 0.0f, 0.0f), 150.0f, 500.0f);

	return S_OK;
}

//=========================================================================================
// タイトルロゴの終了処理
//=========================================================================================
void CTitlelogo::Uninit(void)
{
	//開放
	Release();
}

//=========================================================================================
// タイトルロゴの更新処理
//=========================================================================================
void CTitlelogo::Update(void)
{
	
}

//=========================================================================================
// タイトルロゴの描画処理
//=========================================================================================
void CTitlelogo::Draw(void)
{
	//描画処理
	m_pTitlelogo->Draw();
}

//=========================================================================================
// タイトルロゴの設定処理
//=========================================================================================
CTitlelogo* CTitlelogo::Create(void)
{
	//ポインタの変数を宣言
	CTitlelogo* pTitlelogo = nullptr;

	//オブジェクト2Dの生成
	pTitlelogo = new CTitlelogo;

	if (pTitlelogo != nullptr)
	{//使用されているとき

		//初期化処理
		pTitlelogo->Init();

		//テクスチャの割り当て
		pTitlelogo->BindTexture(m_pTexture);
	}

	//オブジェクト情報を返す
	return pTitlelogo;
}
